package com.example.englishlessons;


//мутим константы в спомогательный класс
public class Utils {

    public static final String LESSON_1 = "Урок 1";
    public static final String DESCRIPTION_1 = "В этом уроке мы изучим 2 новых глагола: to love - любить и to trust - доверять.\n" +
            "Это опять глаголы состояния.\n" +
            "\n" +
            "Как вы помните из прошлого урока, в 3-ем лице единственного числа к глаголам простого настоящего времени добавляется окончание -s.\n" +
            "\n" +
            "I love - Я люблю.\n" +
            "She loves - Она любит.\n" +
            "We trust - Мы доверяем.\n" +
            "He trusts - Он доверяет.\n" +
            "ПРИТЯЖАТЕЛЬНЫЕ МЕСТОИМЕНИЯ\n" +
            "Помимо глаголов мы изучим притяжательные местоимения. В английском у этих местоимений 2 формы, но мы пока познакомимся только с одной - присоединительной - формой. Она так называется, потому что всегда ставится перед существительным.\n" +
            "\n" +
            "my dad - мой папа, his sister - его сестра\n" +
            "\n" +
            "В английском нет местоимения \"свой\", вместо него используются мой, его, её и т.д. согласно контексту. В английском слова не изменяются по падежам и родам, а потому вам нужно запомнить всего по одному варианту каждого местоимения:\n" +
            "I - я, my - мой\n" +
            "we - мы, our - наш\n" +
            "you - вы (ты), your - ваш (твой)\n" +
            "he - он, his - его\n" +
            "she - она, her - её\n" +
            "it - он, она, оно, its - его, её\n" +
            "they - они, their - их\n" +
            "Местоимения it и its даются в более поздних навыках.\n" +
            "\n" +
            "Примеры:\n" +
            "I love my mom. - Я люблю свою (мою) маму.\n" +
            "He loves his son. - Он любит своего (его) сына.\n" +
            "\n" +
            "Вы спросите: как же отличить, любит ли он своего сына, или его - чьего-то чужого? По контексту. Обычно это не вызывает никаких проблем, когда вызывает, можно уточнить.\n" +
            "ПРИМЕЧАНИЕ\n" +
            "you - вы. В английском осталась только форма множественного числа для 2-го лица.\n" +
            "Местоимение thou - ты устарело и больше не используется. Соответственно, английское you можно переводить на русский как \"вы\", так и \"ты\", в зависимости от контекста.";


    public static final String LESSON_2 = "Урок 2";
    public static final String DESCRIPTION_2 = "Здесь добавляем какое то описание 2";
}
